# Задача 24: В фермерском хозяйстве в Карелии выращивают чернику.
# Она растёт на круглой грядке, причём кусты высажены только по окружности. Таким образом, у каждого куста
# есть ровно два соседних. Всего на грядке растёт N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло различное число ягод — 
# на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники. Эта система состоит из 
# управляющего модуля и нескольких собирающих модулей. Собирающий модуль за один заход, 
# находясь непосредственно перед некоторым кустом, собирает ягоды с этого куста и с двух соседних с ним.

# Напишите программу для нахождения максимального числа ягод, которое может собрать за один заход собирающий 
# модуль, находясь перед некоторым кустом заданной во входном файле грядки.

n=int(input('введите количество кустов '))
list=[]  
max_sum=0
sum=0
for i in range(n): 
    m=int(input('введите количество ягод на кусте '))
    list+=[m]
if n>=3:
    for i in range(n-2):
        sum=list[i]+list[i+1]+list[i+2]
        if sum>max_sum:
            max_sum=sum
else:
    for i in range(n):
        max_sum+=list[i]
print(max_sum)